public class Main {
    public static void main(String[] args) {

        int a = 16_676;      // Объявляете переменные для входных данных и
        int b = 20;          // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        int m = (a / b);            // Рассчитываете количество бонусных миль, используя
        System.out.println(m);     // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}